# Importing the necessary packages
# reading csv file into a dataframe 
# creating numpy array out of each column of dataframe

In [2]:
import numpy, pandas

df = pandas.read_csv('SalaryGender.csv', delimiter=',')
salary = numpy.array(df['Salary'])
gender = numpy.array(df['Gender'])
phd = numpy.array(df['PhD'])
age = numpy.array(df['Age'])
print(df)

    Salary  Gender  Age  PhD
0   140.00       1   47    1
1    30.00       0   65    1
2    35.10       0   56    0
3    30.00       1   23    0
4    80.00       0   53    1
5    30.00       0   27    0
6    60.00       1   53    0
7    31.10       0   30    0
8   125.00       1   44    1
9    51.00       1   63    1
10    3.00       1   22    0
11   46.00       1   59    0
12  150.00       1   60    1
13    3.00       1   28    0
14  130.00       1   65    0
15   15.00       0   25    0
16  130.00       1   65    0
17   84.00       0   47    1
18  190.00       1   66    1
19   74.00       1   45    1
20   73.00       0   46    0
21   10.00       0   24    0
22   50.00       0   60    0
23    7.00       0   63    0
24    9.50       0   27    0
25   15.20       1   66    1
26   28.60       1   36    1
27   20.00       0   30    0
28   72.00       0   51    1
29   81.00       1   65    1
..     ...     ...  ...  ...
70   40.70       0   57    0
71   15.00       1   23    0
72    0.25       0   53    0
73  152.00       1   71    1
74   39.80       0   20    0
75   12.00       0   27    0
76   30.00       1   69    1
77  120.00       1   58    1
78    1.70       1   37    0
79   36.00       1   32    1
80   96.00       1   33    1
81   38.00       0   32    1
82   90.00       1   60    0
83    9.00       1   71    0
84   25.80       0   30    0
85   22.00       0   62    0
86   38.80       0   54    0
87   72.00       1   42    1
88   89.00       1   62    0
89   41.00       0   51    1
90   89.00       1   71    1
91   25.00       0   29    0
92   52.00       1   55    1
93  115.00       0   54    0
94   66.00       0   55    1
95   18.60       1   26    0
96  152.00       1   56    1
97    1.80       1   28    0
98   35.00       0   44    0
99    4.00       0   24    0

[100 rows x 4 columns]

In [12]:
print(type(df))
print('df.size >> ', df.size) # Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns
print('df.shape >> ', df.shape) # Returns tuple of shape (Rows, columns) of dataframe/series
print('df.ndim >> ', df.ndim) # Returns dimension of dataframe/series. 1 for one dimension (series), 2 for two dimension (dataframe)

<class 'pandas.core.frame.DataFrame'>
df.size >>  400
df.shape >>  (100, 4)
df.ndim >>  2

In [2]:
df.head()

   Salary  Gender  Age  PhD
0   140.0       1   47    1
1    30.0       0   65    1
2    35.1       0   56    0
3    30.0       1   23    0
4    80.0       0   53    1

In [3]:
df.describe()

           Salary      Gender         Age         PhD
count  100.000000  100.000000  100.000000  100.000000
mean    52.524500    0.500000   46.880000    0.390000
std     42.220933    0.502519   15.271469    0.490207
min      0.250000    0.000000   20.000000    0.000000
25%     20.000000    0.000000   31.500000    0.000000
50%     39.300000    0.500000   49.000000    0.000000
75%     75.500000    1.000000   60.000000    1.000000
max    190.000000    1.000000   77.000000    1.000000

In [4]:
type(salary)

numpy.ndarray

In [5]:
salary

array([140.  ,  30.  ,  35.1 ,  30.  ,  80.  ,  30.  ,  60.  ,  31.1 ,
       125.  ,  51.  ,   3.  ,  46.  , 150.  ,   3.  , 130.  ,  15.  ,
       130.  ,  84.  , 190.  ,  74.  ,  73.  ,  10.  ,  50.  ,   7.  ,
         9.5 ,  15.2 ,  28.6 ,  20.  ,  72.  ,  81.  , 100.  ,  90.  ,
        90.  ,  35.  ,  30.  ,  25.  ,  52.  ,   9.  ,  63.  ,  72.  ,
        16.  ,  92.  , 106.  ,   2.5 ,   9.  ,  32.  ,  32.  ,  55.  ,
        52.  ,  28.  ,  20.  ,  14.7 ,  22.3 ,  34.8 ,  84.  ,  19.  ,
       160.  ,  65.  ,  55.  ,   4.6 , 102.  ,  20.  ,  62.  ,  55.  ,
        45.6 ,  40.  ,  24.  ,  35.  ,  48.  ,  20.  ,  40.7 ,  15.  ,
         0.25, 152.  ,  39.8 ,  12.  ,  30.  , 120.  ,   1.7 ,  36.  ,
        96.  ,  38.  ,  90.  ,   9.  ,  25.8 ,  22.  ,  38.8 ,  72.  ,
        89.  ,  41.  ,  89.  ,  25.  ,  52.  , 115.  ,  66.  ,  18.6 ,
       152.  ,   1.8 ,  35.  ,   4.  ])